# Obtener y conocer sus datos



### Ej 1. Importar las bibliotecas necesarias

In [11]:
import numpy as np
import pandas as pd

### Ej 2. Importar el conjunto de datos desde esta [url](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user) y asignarlo a una variable llamada usuarios y utilizar el 'user_id' como índice

In [12]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

usuarios = pd.read_csv(url, sep='|', header=0, names=['user_id', 'age', 'gender', 'occupation', 'zip_code'])


usuarios.set_index('user_id', inplace=True)

usuarios

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Ej 3. Ver las primeras 25 entradas

In [13]:
usuarios.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Ej 4. Ver las primeras 25 entradas de una forma diferente

In [14]:
usuarios[:25]

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Ej 5. Ver las últimas 10 entradas

In [15]:
print(usuarios[-10:])

print(usuarios.tail(10))

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841
         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Ej 6. ¿Cuál es el número de observaciones en el conjunto de datos?
Resuélvelo de 2 maneras diferentes.

In [16]:
obs = usuarios.shape[0]
print(obs)

943

In [17]:
obs1 = len(usuarios.index)
print(obs1)

943

### Ej 7. ¿Cuál es el número de columnas en el conjunto de datos?
Resuélvelo de 2 maneras diferentes.

In [18]:
print(len(usuarios.columns))

4

In [19]:
print(usuarios.shape[1])

4

### Ej 8. Imprima el nombre de todas las columnas.

In [20]:
print(usuarios.columns)

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [21]:
usuarios.keys()

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

### Ej 9. ¿Cómo se indexa el conjunto de datos? Obtener los valores del índice.

In [22]:
print(usuarios.index)

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

### Ej 10. ¿Cuál es el tipo de datos de cada columna?
Resuélvelo de 2 maneras diferentes.

In [23]:
usuarios.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Ej 11. Imprime solo la columna de ocupación
Resuélvelo de 2 maneras diferentes.

In [25]:
print(usuarios.iloc[::, 2])

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [26]:
usuarios.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Ej 12. ¿Cuántas ocupaciones diferentes hay en este conjunto de datos? ¿Cuántos usuarios por ocupación hay en el conjunto de datos?

In [27]:
ocupacion1 = usuarios.occupation.value_counts()
print(ocupacion1)

print(len(ocupacion1))

occupation
student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: count, dtype: int64
21

In [28]:
usuarios.occupation.nunique()

21

In [29]:
ocupacion2 = usuarios.groupby(['occupation']).size()
print(ocupacion2)

occupation
administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
dtype: int64

### Ej 13. ¿Cuál es la ocupación más frecuente?

In [30]:
ocupacion4 = usuarios.occupation.value_counts()
print(ocupacion4.idxmax(), ocupacion4.max())

student 196

In [31]:
usuarios.occupation.value_counts().head(1)

occupation
student    196
Name: count, dtype: int64

### Ej 14. Resuma el marco de datos.

In [32]:
dif_occupation= usuarios.groupby(["occupation"]).count()

print(dif_occupation)

               age  gender  zip_code
occupation
administrator   79      79        79
artist          28      28        28
doctor           7       7         7
educator        95      95        95
engineer        67      67        67
entertainment   18      18        18
executive       32      32        32
healthcare      16      16        16
homemaker        7       7         7
lawyer          12      12        12
librarian       51      51        51
marketing       26      26        26
none             9       9         9
other          105     105       105
programmer      66      66        66
retired         14      14        14
salesman        12      12        12
scientist       31      31        31
student        196     196       196
technician      27      27        27
writer          45      45        45

### Ej 15. Resumir todas las columnas.

In [33]:
usuarios.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [34]:
display(usuarios.describe(), usuarios.describe(include="object"))

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

       gender occupation zip_code
count     943        943      943
unique      2         21      795
top         M    student    55414
freq      670        196        9

### Ej 16. Resume solo la columna de ocupación.

In [35]:
usuarios.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Ej 17. ¿Cuál es la edad media de los usuarios?

In [36]:
print(usuarios.age.mean())
print(sum(usuarios.age)/943)

34.05196182396607
34.05196182396607

### Ej 18. ¿Cuál es la edad de menor aparición?

In [25]:
usuarios.age.value_counts().idxmin()

7

In [37]:
usuarios["age"].value_counts().tail(10)

age
70    3
62    2
68    2
64    2
69    2
7     1
66    1
11    1
10    1
73    1
Name: count, dtype: int64